# Parameters
nc: 218  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 1  # number of anchors
loss: ComputeXLoss

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, CSPT3, [128]],
#   [-1, 1, C3STR, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, CSPT3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],  # 9    # 8
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3STR, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3STR, [256, False]],  # 17 (P3/8-small)   16

   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ [ -1, 2 ], 1, Concat, [ 1 ] ],  # cat backbone P2
   [ -1, 3, C3STR, [ 128, False ] ],  #  (P2/4-xsmall)

# yolox head
   [12, 1, Conv, [256, 1, 1]],  # 24 lateral0 (P3/8-small)
   [16, 1, Conv, [256, 1, 1]],  # 25 lateral1 (P4/16-medium)
   [20, 1, Conv, [256, 1, 1]],  # 26 lateral2 (P5/32-large)

   [21, 2, Conv, [256, 3, 1]],  # 27 cls0 (P3/8-small)
   [21, 2, Conv, [256, 3, 1]],  # 28 reg0 (P3/8-small)

   [22, 2, Conv, [256, 3, 1]],  # 29 cls1 (P4/16-medium)
   [22, 2, Conv, [256, 3, 1]],  # 30 reg1 (P4/16-medium)

   [23, 2, Conv, [256, 3, 1]],  # 31 cls2 (P5/32-large)
   [23, 2, Conv, [256, 3, 1]],  # 32 reg2 (P5/32-large)

    [[24, 25, 26, 27, 28, 29], 1, DetectX, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
